engines/internal/app/views/internal/article_categories/_form.html.haml

    .field.wide.five
      = f.input :father_id, as: :select, collection: Internal::ArticleCategory.all.order(:name), include_blank: false, include_blank: "Nenhuma"
    .field.wide.two
---
SELECT "article_categories".* FROM "article_categories" ORDER BY "article_categories"."name" ASC