engines/internal/app/views/internal/articles/_form.html.haml

SELECT "article_categories".* FROM "article_categories"
---
  .field
    = f.input :category_ids, as: :select, collection: Internal::ArticleCategory.all, input_html: { multiple: true, class: 'ui fluid dropdown search'}, include_blank: "Selecione uma categoria..."
  .field