engines/internal/app/views/internal/articles/index.html.haml

SELECT "users".* FROM "users" WHERE "users"."author" = $1 ORDER BY "users"."name" ASC  [["author", true]]
---
          .field.wide.four
            = f.input :by_autor, label: "Por autor", as: :select, collection: ::Internal::User.authors.order(:name), include_blank: "Todos", include_blank: "Todos", input_html: { name: :by_autor}, selected: params[:by_autor]
          .field.wide.four